In [1]:
# import dependencies
import pandas as pd

In [6]:
# read in the data
calendar_df = pd.read_csv('./resources/datasets/calendar_data.csv')
client_df = pd.read_csv('./resources/datasets/client_data.csv')
deposit_df = pd.read_csv('./resources/datasets/deposit_data.csv')

In [7]:
# view client data
client_df.head()

,client_id,client_geographical_region,client_residence_status,client_age
0,538839486596724,Northeast,Rent,91
1,321708286091707,West,Own,83
2,848531901757235,Midwest,Own,84
3,854405182328779,Northeast,Own,83
4,769102176031316,West,Own,85

In [8]:
# view deposit data
deposit_df.head()

,client_id,deposit_type,deposit_amount,deposit_cadence,deposit_date
0,446495122764671,Actual Deposit,303.0,Monthly,2019-10-23
1,446495122764671,Actual Deposit,303.0,Monthly,2019-09-23
2,446495122764671,Scheduled Deposit,303.0,Monthly,2019-09-23
3,446495122764671,Scheduled Deposit,303.0,Monthly,2019-10-23
4,446495122764671,Scheduled Deposit,303.0,Monthly,2019-06-23

In [9]:
# view calendar data
calendar_df.head()

  gregorian_date month_name
0     2019-06-01    Month 1
1     2019-06-02    Month 1
2     2019-06-03    Month 1
3     2019-06-04    Month 1
4     2019-06-05    Month 1